Repository: yeager/swedish-tm
Catalog: reviewed/catalogs/phpmyadmin-5-2.tmx
Source language: en
Languages: sv

source: Query results operations
sv: Operationer för frågeresultat

source: Enabling the general_log may increase the server load by 5-15%. Also be aware that generating statistics from the logs is a load intensive task, so it is advisable to select only a small time span and to disable the general_log and empty its table once monitoring is not required any more.
sv: Att aktivera "general_log" kan öka belastningen på servern med 5-15%. Var också medveten om att generera statistik från loggarna är en belastningsintensiv uppgift, så det är klokt att välja en kort tidsperiod samt att inaktivera "general_log" och tömma tabellen när övervakningen inte behövs längre.

source: Not used for this MySQL version.
sv: Används inte i den här MySQL-versionen.

source: End of step
sv: Delslut

source: Activate now
sv: Aktivera nu

source: Execute at
sv: Utför vid

source: Table %s has been copied to %s. Privileges have been adjusted.
sv: Registret %s har kopierats till %s., privilegier har justerats.

source: The total number of blocks in the query cache.
sv: Totala antalet block i frågecachen.

source: Missing value in the form!
sv: Värde saknas i formuläret!

source: Thu
sv: Tors

source: Table lock wait rate: %s, this value should be less than 1 per hour
sv: Tabellåsning,.andel väntan: %s, detta värde bör vara mindre än 1 per timme

source: Remove partitioning
sv: Ta bort partitionering

source: Wednesday
sv: Onsdag

source: Full texts
sv: Kompletta texter

source: Select two different columns
sv: Välj två olika kolumner

source: Read as multibytes
sv: Läs som multibytes

source: Whether the table structure actions should be hidden.
sv: Om tabellstrukturåtgärderna ska döljas eller inte.

source: Customize edit mode.
sv: Anpassa redigeringsläge.

source: Enclose export in a transaction
sv: Bifoga export i en transaktion

source: Event name
sv: Händelsenamn

source: Missing information to delete the search.
sv: Saknar information för att ta bort sökningen.

source: %d is not valid row number.
sv: %d är inte ett giltigt radnummer.

source: The number of pages written.
sv: Antalet skrivna sidor.

source: Original string
sv: Ursprunglig sträng

source: The compiled-in InnoDB page size (default 16KB). Many values are counted in pages; the page size allows them to be easily converted to bytes.
sv: Den inkompilerade InnoDB-sidstorleken (standard 16kB). Många värden räknas i sidor; sidstorleken tillåter dem att enkelt omvandlas till bytes.

source: The thread cache is set to 0
sv: Trådad cache är satt till 0

source: slow_launch_time is set to %s
sv: slow_launch_time är satt till %s

source: Local monitor configuration incompatible!
sv: Lokal övervakningskonfiguration ej kompatibel!

source: Show current browsing query
sv: Visa sökningar under denna session

source: Rebuild partition
sv: Återskapa partition

source: Delete user group
sv: Ta bort användargrupp

source: Customize the navigation tree.
sv: Anpassa navigeringspanelen.

source: Table maintenance
sv: Tabellunderhåll

source: Show me the central list of columns that are not already in this table
sv: Visa mig kolumner i huvudlistan som inte redan finns i den här tabellen

source: The number of executed FLUSH statements.
sv: Antalet utförda FLUSH-satser.

source: Use persistent connections to MySQL databases.
sv: Använd bestående anslutningar till MySQL-databaser.

source: The uploaded file exceeds the upload_max_filesize directive in php.ini.
sv: Den uppladdade filen överskrider direktivet upload_max_filesize i php.ini.

source: Prior to changing any of the configuration, be sure to know what you are changing (by reading the documentation) and how to undo the change. Wrong tuning can have a very negative effect on performance.
sv: Innan du ändrar något av konfigurationen måste du veta vad du håller på att ändra (genom att läsa dokumentation) och hur du kan ångra ändringen. Fel inställning kan ha en mycket negativ inverkan på prestandan.

source: Snap to grid
sv: Fäst vid rutnät

source: Find any errors in the query before executing it. Requires CodeMirror to be enabled.
sv: Rätta till sökningen innan du kör den. Kräver att "CodeMirror" aktiveras.

source: Query cache efficiency
sv: Frågecache effektivitet

source: Reload
sv: Uppdatera

source: Missing parameter:
sv: Saknade parametrar:

source: Add replica replication user
sv: Lägg till replikeringsanvändare

source: Handler
sv: Hanterare

source: per second:
sv: per sekund:

source: Database level tabs
sv: Flikar på databasnivå

source: Show hidden items
sv: Visa dolda objekt

source: Comment out these two lines if you do not need them.
sv: Kommentera bort dessa två rader om du inte behöver dem.

source: PiB
sv: PB

source: Missing information to save the bookmarked search.
sv: Saknar information för att spara den bokmärkta sökningen.

source: Show
sv: Visa

source: Deactivate now
sv: Deaktivera nu

source: Create bookmark
sv: Skapa bokmärke

source: Check partition
sv: Kontrollera partition

source: See more
sv: Se mer

source: Query by example
sv: Fråga genom exempel

source: Login without a password is forbidden by configuration (see AllowNoPassword)
sv: Inloggning utan lösenord är inte tillåtet enligt konfiguration (se AllowNoPassword)

source: There are no events to display.
sv: Det finns inga händelser att visa.

source: Configurable menus:
sv: Konfigurerbara menyer:

source: Prepends and/or Appends text to a string. First option is text to be prepended, second is appended (enclosed in single quotes, default empty string).
sv: Lägger till text före eller efter en sträng. Det första valet är text att läggas till före strängen, andra valet läggs till efter (inom enkla citattecken, standardvärde är tom sträng).

source: Immediate table locks %
sv: Omedelbara tabellåsningar: %

source: Cannot connect: invalid settings.
sv: Kan ej skapa förbindelse: ogiltiga inställningar.

source: Skip Explain SQL
sv: Utan SQL-förklaring

source: Query history length
sv: Längd på frågehistorik

source: The number of tables that are open.
sv: Antalet tabeller som är öppna.

source: Cannot rename database to the same name. Change the name and try again.
sv: Kan inte byta namn på databasen till samma namn. Ändra namnet och försök igen.

source: Show binary contents
sv: Visa binärt innehåll

source: The number of requests to read a row based on a fixed position. This is high if you are doing a lot of queries that require sorting of the result. You probably have a lot of queries that require MySQL to scan whole tables or you have joins that don't use keys properly.
sv: Antalet efterfrågningar att läsa en rad baserat på en fix position. Detta värde är högt om du ställer många frågor som kräver sortering av resultatet. Du har förmodligen många frågor som kräver att MySQL avsöker hela tabeller eller du har föreningar som inte använder nycklar på rätt sätt.

source: Data files
sv: Datafiler

source: Right
sv: Höger

source: Git information missing!
sv: Git-information saknas!

source: Table lock wait rate
sv: Tabell låsning. Andelen vänta

source: Execution results of routine %s
sv: Exekveringsresultat av rutin %s

source: MEDIA TYPES FOR TABLE
sv: MEDIATYPER FÖR TABELL

source: Third step of normalization (1NF+2NF+3NF)
sv: Tredje steget i normalisering (1NF + 2NF + 3NF)

source: Routine %1$s has been created.
sv: Rutinen %1$s har skapats.

source: The query cache is enabled and the server receives %d queries per second. This rule fires if there is more than 100 queries per second.
sv: Frågecachen är aktiverad och servern tar emot %d förfrågningar per sekund. Denna regel aktiveras när det är mer än 100 förfrågningar per sekund.

source: Calls
sv: Anrop

source: Failed to read configuration file!
sv: Kunde inte läsa konfigurationsfilen!

source: Use this for future exports
sv: Använd detta för framtida exporter

source: Confirm transitive dependencies
sv: Bekräfta transitiva beroenden

source: Autoextend increment
sv: Automatisk utökningsstorlek

source: Remove
sv: Ta bort

source: Allow the interruption of an import in case the script detects it is close to the PHP timeout limit.
sv: Tillåt att en import avbryts om skriptet upptäcker att den närmar sig PHP:s tidsgräns.

source: SQL compatibility mode:
sv: SQL kompatibilitetsläge:

source: insert multiple rows in every <code>INSERT</code> statement<br> &nbsp; &nbsp; &nbsp; Example: <code>INSERT INTO tbl_name VALUES (1,2,3), (4,5,6), (7,8,9)</code>
sv: mata in flera rader i varje <code>INSERT</code>-kommando<br> &nbsp; &nbsp; &nbsp; Exempel: <code>INSERT INTO tbl_name VALUES (1,2,3), (4,5,6), (7,8,9)</code>

source: Hide table structure actions
sv: Dölj åtgärder för tabellstruktur

source: Stop IO Thread only
sv: Stoppa endast IO-tråd

source: Hide panel
sv: Dölj Panel

source: Download
sv: Ladda ner

source: Criteria:
sv: Kriterier:

source: Whether to show tables under database in the navigation tree
sv: Om du vill visa tabeller från databasen i navigeringsträdet

source: Please scan following QR code into the two-factor authentication app on your device and enter authentication code it generates.
sv: Skanna följande QR-kod i tvåfaktorsautentiseringsappen på enheten och ange autentiseringskoden som den genererar.

source: MySQL reserved word warning
sv: Varning för reserverat MySQL-ord

source: Bind parameters
sv: Binda parametrar

source: Loading logs
sv: Läser in loggar

source: Series:
sv: Serie:

source: phpMyAdmin Themes
sv: phpMyAdmin-teman

source: Syntax to use when inserting data
sv: Syntax att använda när man infogar data

source: See %sour documentation%s for more information.
sv: Se %sdokumentationen%s för mer information.

source: Privileges
sv: Privilegier

source: You can also edit most values<br>by double-clicking directly on them.
sv: Du kan även redigera de flesta värden<br>genom att dubbelklicka direkt på dessa.

source: Please enter a valid HEX input
sv: Skriv in en giltig Hexadecimalt värde

source: Repair partition
sv: Reparera partition

source: Change settings
sv: Ändra inställningar

source: Hide search results
sv: Dölj sökresultat

source: Monday
sv: Måndag

source: Replica replication
sv: Replika-replikering

source: Defines whether or not type fields should be initially displayed in edit/insert mode.
sv: Anger om typ-fält först bör visas i ändra/infoga-läge.

source: Convert to Kana
sv: Konvertera till Kana

source: Includes all privileges except GRANT.
sv: Inkluderar alla privilegier förutom GRANT.

source: All
sv: Alla

source: You must provide a name and a type for each routine parameter.
sv: Du måste ange ett namn och en typ för varje rutinparameter.

source: %s%% of all temporary tables are being written to disk, this value should be below 25%%
sv: %s%% av alla temporära tabeller skrivna till disk, detta värde bör vara mindre än 25%%

source: Enabling this allows a page located on a different domain to call phpMyAdmin inside a frame, and is a potential [strong]security hole[/strong] allowing cross-frame scripting (XSS) attacks.
sv: Om detta aktiveras tillåts att en sida som ligger på en annan domän anropar phpMyAdmin i en ram, vilket är ett potentiellt [strong]säkerhetshål[/strong] som tillåter XSS-angrepp (cross-frame scripting).

source: For display Options
sv: Visningsalternativ

source: The number of joins that used a range search on a reference table.
sv: Antalet kopplingar som använde en urvalssökning på en referenstabell.

source: Error: Missing index on column(s).
sv: Fel: Saknade index på kolumn/erna.

source: Rate of sorts that cause temporary tables
sv: Andelen sorteringar som orsakar temporära tabeller

source: Request parameter for reCAPTCHA v2 API
sv: Begärandeparameter för reCAPTCHA v2-API

source: Do a "query by example" (wildcard: "%")
sv: Utför en "Query By Example" (jokertecken: "%")

source: Use natural order for sorting table and database names.
sv: Använd naturlig ordning vid sortering av tabell- och databasnamn.

source: Sort rows
sv: Sortera rader

source: Explain
sv: Förklara

source: Enable linter
sv: Aktivera filtrering

source: No databases
sv: Inga databaser

source: Column name copying to clipboard failed!
sv: Kopiering av kolumnnamnet till urklipp misslyckades.

source: Maximum items on first level
sv: Maximalt antal objekt på första nivån

source: You don't have sufficient privileges to be here right now!
sv: Du har inte tillräcklig behörighet för att vara här nu!

source: Specify browser's title bar text. Refer to [doc@faq6-27]documentation[/doc] for magic strings that can be used to get special values.
sv: Ange webbläsarens namnlisttext. Se [doc@faq6-27]Table]documentation[/doc] för magiska strängar som kan användas för att få speciella värden.

source: Row size
sv: Radstorlek

source: No data was received to import. Either no file name was submitted, or the file size exceeded the maximum size permitted by your PHP configuration. See [doc@faq1-16]FAQ 1.16[/doc].
sv: Inga data att importera mottogs. Antingen angavs inget filnamn eller så översteg filens storlek den maximalt tillåtna storleken i din PHP-konfiguration. Se [doc@faq1-16]FAQ 1.16[/doc].

source: Allows importing data from and exporting data into files.
sv: Tillåter import av data från och export av data till filer.

source: Format-specific options:
sv: Format-specifika alternativ:

source: Wed
sv: Ons

source: Settings for phpMyAdmin developers.
sv: Inställningar för phpMyAdmin-utvecklare.

source: Please connect your FIDO U2F device into your computer's USB port. Then confirm registration on the device.
sv: Anslut FIDO U2F-enheten till datorns USB-port. Bekräfta sedan registreringen på enheten.

source: The number of bytes written to the log file.
sv: Antalet bytes skrivna till loggfilen.

source: Initial state for sliders
sv: Utgångsläge för reglagen

source: Displaying column comments:
sv: Visning av kolumnkommentarer:

source: Drop the database (DROP)
sv: Tag bort databasen (DROP)

source: Find and replace
sv: Sök och ersätt

source: Armenian
sv: Armenisk

source: Primary server changed successfully to %s.
sv: Primärservern har ändrats till %s.

source: This plugin does not support compressed imports!
sv: Detta insticksprogram stöder inte komprimerade importer!

source: The size of the memory buffer InnoDB uses to cache data and indexes of its tables.
sv: Storleken på minnesbufferten som InnoDB använder för cache av data och index till sina tabeller.

source: Previous
sv: Föregående

source: If it's not possible to make existing column combinations as primary key
sv: Om det inte är möjligt att göra kolumnkombinationer till primärnyckel

source: Sorting
sv: Sortering

source: Settings
sv: Inställningar

source: Views
sv: Vy

source: Relation table
sv: Relationstabell

source: Comments
sv: Kommentarer

source: System CPU usage
sv: Processoranvändning (CPU)

source: MediaWiki Table
sv: MediaWiki-tabell

source: The number of pages read.
sv: Antalet lästa sidor.

source: Value must be less than or equal to %s!
sv: Värdet måste vara lika med eller mindre än %s!

source: There is a mismatch between HTTPS indicated on the server and client. This can lead to a non working phpMyAdmin or a security risk. Please fix your server configuration to indicate HTTPS properly.
sv: HTTPS-inställningen skiljer sig mellan servern och klienten. Det kan göra att phpMyAdmin inte fungerar eller skapa en säkerhetsrisk. Korrigera serverkonfigurationen så att HTTPS anges korrekt.

source: Invalid direction "%s" given for parameter.
sv: Ogiltig riktning "%s" angiven för parameter.

source: Check tables having overhead
sv: Kontrollera tabeller med overhead

source: MySQL accepts additional values not selectable by the datepicker; key in those values directly if desired
sv: MySQL accepterar ytterligare värden som inte går att välja med datumväljaren; tryck in de värdena manuellt om du önskar

source: A time, range is %1$s to %2$s
sv: En tid, området är %1$s till %2$s

source: Table comments:
sv: Tabellkommentarer:

source: Two-factor authentication failed.
sv: Tvåfaktorsautentiseringen misslyckades.

source: To
sv: Till

source: Comment:
sv: Kommentar:

source: The number of free memory blocks in query cache. High numbers can indicate fragmentation issues, which may be solved by issuing a FLUSH QUERY CACHE statement.
sv: Antalet fria minnesblock i frågecache. Högt antal kan tyda på fragmentering, vilket kan lösas genom att köra ett FLUSH QUERY CACHE-kommando.

source: Percentage of aborted connections
sv: Andelen avbrutna anslutningar

source: Remove from Favorites
sv: Ta bort från favoriter

source: Favorite List is full!
sv: Favoritlistan är full!

source: Allows user to give to other users or remove from other users the privileges that user possess yourself.
sv: Tillåter att användaren ger andra användare eller tar bort från andra användare de behörigheter som användaren själv har.

source: Configuration of pmadb…
sv: Konfiguration av pmadb…

source: Requires SSL-encrypted connections.
sv: Kräver SSL-krypterade anslutningar.

source: Dumping data for table
sv: Dumpning av Data i tabell

source: The number writes done to the InnoDB buffer pool.
sv: Antalet skrivningar gjorda till InnoDB-bufferten.

source: Variables
sv: Variabler

source: Statements
sv: Uppgifter

source: Host name:
sv: Värdnamn:

source: The host name is empty!
sv: Värdnamnet är tomt!

source: Reload page
sv: Uppdatera sidan

source: Events:
sv: Händelser:

source: Target for second quick access icon
sv: Mål för sekundär snabbåtkomst-ikon

source: Using bookmark "%s" as default browse query.
sv: Använd bokmärket "%s" som standard webbläsarfråga.

source: Severe fragmentation is likely to (further) increase Qcache_lowmem_prunes. This might be caused by many Query cache low memory prunes due to {query_cache_size} being too small. For a immediate but short lived fix you can flush the query cache (might lock the query cache for a long time). Carefully adjusting {query_cache_min_res_unit} to a lower value might help too, e.g. you can set it to the average size of your queries in the cache using this formula: (query_cache_size - qcache_free_memory) / qcache_queries_in_cache
sv: Kraftig fragmentering kommer sannolikt öka Qcache_lowmem_prunes. Detta kan bero på många låga Query cache prune på grund av att query_cache_size är för liten. För en omedelbar, men kortlivad fix du kan rensa frågecache (kan låsa frågecachen under lång tid). Justera försiktigt {query_cache_min_res_unit} till ett lägre värde kan hjälpa, Du kan t.ex. sätta den till den genomsnittliga storleken på dina frågor i cachen med följande formel: (query_cache_size - qcache_free_memory) / qcache_queries_in_cache

source: Change all column collations
sv: Ändra alla kolumners sortering

source: Show row links anyway
sv: Visa länkade rader ändå

source: January
sv: januari

source: Enable CodeMirror
sv: Aktivera CodeMirror

source: Enter:
sv: Ange:

source: Add
sv: Lägg till

source: About %MIN min. %SEC sec. remaining.
sv: Ungefär %MIN min. %SEC sek. återstår.

source: This MySQL server has been running for %1$s. It started up on %2$s.
sv: Denna MySQL-servern har varit igång i %1$s. Den startade den %2$s.

source: Too many table locks were not granted immediately.
sv: Alltför många tabell låsningar beviljades inte omedelbart.

source: You can reset all your settings and restore them to default values.
sv: Du kan återställa alla inställningar och återföra dem till standardvärdena.

source: Max. concurrent connections
sv: Max antal samtidiga förbindelser

source: No databases selected.
sv: Inga databaser markerade.

source: Version is compiled from source, not a MySQL official binary.
sv: Version är kompilerad från källan, inte från en officiell MySQL binär.

source: Main panel
sv: Huvudpanel

source: %s result found
sv: %s resultat hittat

source: %s results found
sv: %s resultat hittade

source: Bar
sv: Stapel

source: Do not use <code>AUTO_INCREMENT</code> for zero values
sv: Använd inte <code>AUTO_INCREMENT</code> för nollvärden

source: Network traffic since startup: %s
sv: Nätverkstrafik sedan start: %s

source: Please enter a valid length!
sv: Var vänlig ange en giltig längd!

source: You don't have sufficient privileges to perform this operation; Please refer to the documentation for more details
sv: Du har inte tillräcklig behörighet att utföra åtgärden; Se dokumentationen för mer information

source: No dependencies selected!
sv: Inga beroenden valda!

source: Error resetting replication.
sv: Fel vid återställning av replikering.

source: The amount of data written to the transaction log before a checkpoint is performed. The default value is 24MB.
sv: Mängden data som skrivs till transaktionsloggen innan en kontrollpunkt utförs. Standardvärdet är 24MB.

source: Replication
sv: Replikering

source: Created
sv: Skapad

source: Name of the new table (optional):
sv: Namn på den nya tabellen (valfritt):

source: Use delayed inserts
sv: Använd fördröjda inläggningar

source: Server name template
sv: Mall för servernamn

source: Index directory
sv: Indexkatalog

source: Creation/Update/Check dates
sv: Skapad/Uppdaterad/Kontrollerad datum

source: The number of requests to read the next row in the data file. This is high if you are doing a lot of table scans. Generally this suggests that your tables are not properly indexed or that your queries are not written to take advantage of the indexes you have.
sv: Antalet efterfrågningar att läsa den följande raden i datafilen. Detta värde är högt om du gör många tabellavsökningar. I allmänhet antyder detta att dina tabeller inte är riktigt indexerade eller att dina frågor inte är skrivna för att dra nytta av de index du har.

source: File could not be read!
sv: Filen kunde inte läsas!

source: Encoding Conversion:
sv: Omkodning:

source: Y-Axis label:
sv: Y-axel etikett:

source: Add AUTO_INCREMENT value
sv: Lägg till AUTO_INCREMENT-värde

source: Uncheck the checkbox to disable drag and drop import
sv: Avmarkera kryssrutan för att inaktivera import med dra och släpp

source: Track these data manipulation statements:
sv: Spåra dessa datahanteringskommandon:

source: Schema of the %s database - Page %s
sv: Schema för databasen %s - Sida %s

source: Threads
sv: Trådar

source: The number of physical reads of a key block from disk. If Key_reads is big, then your key_buffer_size value is probably too small. The cache miss rate can be calculated as Key_reads/Key_read_requests.
sv: Antalet fysiska läsningar av ett nyckelblock från disk. Om värdet Key_reads är stort, då är förmodligen ditt värde key_buffer_size för litet. Cachens missfrekvens kan beräknas som Key_reads/Key_read_requests.

source: Time
sv: Tid

source: Servers
sv: Servrar

source: No privileges to create databases
sv: Saknar behörighet att skapa databaser

source: Show/hide columns
sv: Visa/Dölj kolumner

source: Switch to %svisual builder%s
sv: Växla till %sgrafisk modellerare%s

source: Direction
sv: Riktning

source: Copy
sv: Kopiera

source: Queried time
sv: Exekveringstid för frågor

source: Create relationship
sv: Skapa relation

source: Free pages
sv: Fria sidor

source: Do you really want to delete this bookmark?
sv: Vill du verkligen ta bort detta bokmärke?

source: Do you want to import remaining settings?
sv: Vill du importera återstående inställningar?

source: Defines whether SQL queries generated by phpMyAdmin should be displayed.
sv: Anger om SQL-frågor som genereras av phpMyAdmin ska visas.

source: Inner ring
sv: Inre ringen

source: log_output is not set to TABLE.
sv: log_output är inte definierad som TABLE.

source: Execute queries on Enter and insert new line with Shift+Enter
sv: Utför frågor med Retur och infoga en ny rad med Skift+Retur

source: Server connection collation
sv: Serveranslutning kollationering

source: Functions
sv: Funktioner

source: Indexes for dumped tables
sv: Index för dumpade tabeller

source: Data dump options
sv: Dumpningsalternativ för data
